Compiled by Ebude Yolande

## Introduction

Nowadays, most companies use database to store information. There are different kind of database but in this workshop we will handle Structured Query Language (SQL) type: SQLite. To start download this dataset <a href='https://drive.google.com/file/d/151p846LIvDjQD9WG3fRu2w5L2rQFZSK2/view?usp=sharing'>SqLite file</a>

## Content

- Import different database types
- Modify database

In [1]:
import sqlite3 as sq
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

## Import different database types

### SQlite

In [2]:
conn=sq.connect('GeneratorRefilling.sqlite')
cur=conn.cursor()
query="SELECT * FROM RefillingGen2018"
data=pd.read_sql(query,conn)
data.head(3)

,Generator,Buyer_Name,Purchase_Quantity,Purchase_Date,Purchase_Time,Payment,Mass,Generator_Amount,Refilling_Name,Refilling_Quantity,Refilling_Date,Refilling_Time,Check
0,Genset1,Andy,756.0,02/01/15,15:25,453600,628.992,756.0,Andy,756.0,03/01/15,07:10,1
1,Genset5,Kate,163.5,04/01/15,10:45,98100,136.032,163.5,Kate,163.5,03/01/15,17:10,1
2,Genset9,Louis,860.0,06/01/15,15:45,516000,715.520,860.0,Kate,800.0,06/01/15,17:40,1

### Dat file

In [3]:
tab = pd.read_table('3055.dat')
temp=tab.columns
tab.columns=['num','val','Firstname','Lastname','Email',
             'val1','unit','Date','Datetime','Verify'] # change the header
tab.iloc[-1]=temp #assign header to last row
tab.tail(3)

,num,val,Firstname,Lastname,Email,val1,unit,Date,Datetime,Verify
596,598,1,Wade,Delvalle,wade.delvalle@sakilacustomer.org,604,t,2006-02-14,2013-05-26 14:49:45.738,1
597,599,2,Austin,Cintron,austin.cintron@sakilacustomer.org,605,t,2006-02-14,2013-05-26 14:49:45.738,1
598,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,t,2006-02-14,2013-05-26 14:49:45.738,1.1

## Modify database

Create a table

In [5]:
conn=sq.connect('GeneratorRefilling.sqlite')
cur=conn.cursor()
query='CREATE TABLE People (id integer PRIMARYKEY, name char(25), time Date)'
conn.execute(query)

Create new table of an existing dataframe

In [6]:
tab.to_sql('Tab3055',conn)

In [7]:
query="SELECT * FROM Tab3055"
tab3055=pd.read_sql(query,conn)
tab3055.head(3)

,index,num,val,Firstname,Lastname,Email,val1,unit,Date,Datetime,Verify
0,0,1,1.0,Mary,Smith,mary.smith@sakilacustomer.org,5.0,t,2006-02-14,2013-05-26 14:49:45.738,1.0
1,1,2,1.0,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6.0,t,2006-02-14,2013-05-26 14:49:45.738,1.0
2,2,3,1.0,Linda,Williams,linda.williams@sakilacustomer.org,7.0,t,2006-02-14,2013-05-26 14:49:45.738,1.0

Add rows in new table

In [8]:
query = "INSERT INTO People(id, name, time) VALUES ('1','Penina','12/01/2019')"
conn.execute(query)
query="SELECT * FROM People"
Peop=pd.read_sql(query,conn)
Peop.head()

   id    name        time
0   1  Penina  12/01/2019

Delete rows in table

In [9]:
query = "DELETE FROM Tab3055 WHERE Firstname=='Mary'"
conn.execute(query)

Change a value in the table

In [10]:
query = "UPDATE People SET name='Angela' WHERE id='1'" 
conn.execute(query)

In [11]:
query="SELECT * FROM People"
Peop=pd.read_sql(query,conn)
Peop.head()

   id    name        time
0   1  Angela  12/01/2019

Close the database

In [12]:
conn.close()

## Challenge

1. Import "GeneratorRefilling.sqlite" and "3057.dat" and change the header of "3057.dat" to ['num','name','surname','date']

2. Create a table in the database for "3057.dat" called Tab3057

3. Delete the "Tab3055" table

4. Add a row to Tab3057 table

5. Delete the 3rd row of Tab3057

6.  Add column 'Verify' to Tab3057 and assign 1 is num>50 and 0 else